ARMmbed/mbed-os/targets/TARGET_Maxim/TARGET_MAX32670/Libraries/PeriphDrivers/Source/DMA/dma_reva_regs.h
 #define MXC_F_DMA_REVA_CTRL_REQUEST_POS                     4 /**< CTRL_REQUEST Position */
 #define MXC_F_DMA_REVA_CTRL_REQUEST                         ((uint32_t)(0x3FUL << MXC_F_DMA_REVA_CTRL_REQUEST_POS)) /**< CTRL_REQUEST Mask */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_MEMTOMEM                ((uint32_t)0x0UL) /**< CTRL_REQUEST_MEMTOMEM Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_MEMTOMEM                (MXC_V_DMA_REVA_CTRL_REQUEST_MEMTOMEM << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_MEMTOMEM Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_SPI0RX                  ((uint32_t)0x1UL) /**< CTRL_REQUEST_SPI0RX Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_SPI0RX                  (MXC_V_DMA_REVA_CTRL_REQUEST_SPI0RX << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_SPI0RX Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_SPI1RX                  ((uint32_t)0x2UL) /**< CTRL_REQUEST_SPI1RX Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_SPI1RX                  (MXC_V_DMA_REVA_CTRL_REQUEST_SPI1RX << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_SPI1RX Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_SPI2RX                  ((uint32_t)0x3UL) /**< CTRL_REQUEST_SPI2RX Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_SPI2RX                  (MXC_V_DMA_REVA_CTRL_REQUEST_SPI2RX << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_SPI2RX Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_UART0RX                 ((uint32_t)0x4UL) /**< CTRL_REQUEST_UART0RX Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_UART0RX                 (MXC_V_DMA_REVA_CTRL_REQUEST_UART0RX << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_UART0RX Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_UART1RX                 ((uint32_t)0x5UL) /**< CTRL_REQUEST_UART1RX Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_UART1RX                 (MXC_V_DMA_REVA_CTRL_REQUEST_UART1RX << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_UART1RX Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_I2C0RX                  ((uint32_t)0x7UL) /**< CTRL_REQUEST_I2C0RX Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_I2C0RX                  (MXC_V_DMA_REVA_CTRL_REQUEST_I2C0RX << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_I2C0RX Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_I2C1RX                  ((uint32_t)0x8UL) /**< CTRL_REQUEST_I2C1RX Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_I2C1RX                  (MXC_V_DMA_REVA_CTRL_REQUEST_I2C1RX << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_I2C1RX Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_ADC                     ((uint32_t)0x9UL) /**< CTRL_REQUEST_ADC Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_ADC                     (MXC_V_DMA_REVA_CTRL_REQUEST_ADC << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_ADC Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_UART2RX                 ((uint32_t)0xEUL) /**< CTRL_REQUEST_UART2RX Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_UART2RX                 (MXC_V_DMA_REVA_CTRL_REQUEST_UART2RX << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_UART2RX Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_SPI3RX                  ((uint32_t)0xFUL) /**< CTRL_REQUEST_SPI3RX Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_SPI3RX                  (MXC_V_DMA_REVA_CTRL_REQUEST_SPI3RX << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_SPI3RX Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_SPI_MSS0RX              ((uint32_t)0x10UL) /**< CTRL_REQUEST_SPI_MSS0RX Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_SPI_MSS0RX              (MXC_V_DMA_REVA_CTRL_REQUEST_SPI_MSS0RX << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_SPI_MSS0RX Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_USBRXEP1                ((uint32_t)0x11UL) /**< CTRL_REQUEST_USBRXEP1 Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_USBRXEP1                (MXC_V_DMA_REVA_CTRL_REQUEST_USBRXEP1 << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBRXEP1 Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_USBRXEP2                ((uint32_t)0x12UL) /**< CTRL_REQUEST_USBRXEP2 Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_USBRXEP2                (MXC_V_DMA_REVA_CTRL_REQUEST_USBRXEP2 << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBRXEP2 Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_USBRXEP3                ((uint32_t)0x13UL) /**< CTRL_REQUEST_USBRXEP3 Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_USBRXEP3                (MXC_V_DMA_REVA_CTRL_REQUEST_USBRXEP3 << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBRXEP3 Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_USBRXEP4                ((uint32_t)0x14UL) /**< CTRL_REQUEST_USBRXEP4 Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_USBRXEP4                (MXC_V_DMA_REVA_CTRL_REQUEST_USBRXEP4 << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBRXEP4 Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_USBRXEP5                ((uint32_t)0x15UL) /**< CTRL_REQUEST_USBRXEP5 Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_USBRXEP5                (MXC_V_DMA_REVA_CTRL_REQUEST_USBRXEP5 << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBRXEP5 Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_USBRXEP6                ((uint32_t)0x16UL) /**< CTRL_REQUEST_USBRXEP6 Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_USBRXEP6                (MXC_V_DMA_REVA_CTRL_REQUEST_USBRXEP6 << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBRXEP6 Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_USBRXEP7                ((uint32_t)0x17UL) /**< CTRL_REQUEST_USBRXEP7 Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_USBRXEP7                (MXC_V_DMA_REVA_CTRL_REQUEST_USBRXEP7 << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBRXEP7 Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_USBRXEP8                ((uint32_t)0x18UL) /**< CTRL_REQUEST_USBRXEP8 Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_USBRXEP8                (MXC_V_DMA_REVA_CTRL_REQUEST_USBRXEP8 << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBRXEP8 Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_USBRXEP9                ((uint32_t)0x19UL) /**< CTRL_REQUEST_USBRXEP9 Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_USBRXEP9                (MXC_V_DMA_REVA_CTRL_REQUEST_USBRXEP9 << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBRXEP9 Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_USBRXEP10               ((uint32_t)0x1AUL) /**< CTRL_REQUEST_USBRXEP10 Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_USBRXEP10               (MXC_V_DMA_REVA_CTRL_REQUEST_USBRXEP10 << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBRXEP10 Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_USBRXEP11               ((uint32_t)0x1BUL) /**< CTRL_REQUEST_USBRXEP11 Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_USBRXEP11               (MXC_V_DMA_REVA_CTRL_REQUEST_USBRXEP11 << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBRXEP11 Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_SPI0TX                  ((uint32_t)0x21UL) /**< CTRL_REQUEST_SPI0TX Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_SPI0TX                  (MXC_V_DMA_REVA_CTRL_REQUEST_SPI0TX << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_SPI0TX Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_SPI1TX                  ((uint32_t)0x22UL) /**< CTRL_REQUEST_SPI1TX Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_SPI1TX                  (MXC_V_DMA_REVA_CTRL_REQUEST_SPI1TX << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_SPI1TX Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_SPI2TX                  ((uint32_t)0x23UL) /**< CTRL_REQUEST_SPI2TX Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_SPI2TX                  (MXC_V_DMA_REVA_CTRL_REQUEST_SPI2TX << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_SPI2TX Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_UART0TX                 ((uint32_t)0x24UL) /**< CTRL_REQUEST_UART0TX Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_UART0TX                 (MXC_V_DMA_REVA_CTRL_REQUEST_UART0TX << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_UART0TX Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_UART1TX                 ((uint32_t)0x25UL) /**< CTRL_REQUEST_UART1TX Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_UART1TX                 (MXC_V_DMA_REVA_CTRL_REQUEST_UART1TX << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_UART1TX Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_I2C0TX                  ((uint32_t)0x27UL) /**< CTRL_REQUEST_I2C0TX Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_I2C0TX                  (MXC_V_DMA_REVA_CTRL_REQUEST_I2C0TX << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_I2C0TX Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_I2C1TX                  ((uint32_t)0x28UL) /**< CTRL_REQUEST_I2C1TX Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_I2C1TX                  (MXC_V_DMA_REVA_CTRL_REQUEST_I2C1TX << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_I2C1TX Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_UART2TX                 ((uint32_t)0x2EUL) /**< CTRL_REQUEST_UART2TX Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_UART2TX                 (MXC_V_DMA_REVA_CTRL_REQUEST_UART2TX << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_UART2TX Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_SPI3TX                  ((uint32_t)0x2FUL) /**< CTRL_REQUEST_SPI3TX Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_SPI3TX                  (MXC_V_DMA_REVA_CTRL_REQUEST_SPI3TX << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_SPI3TX Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_SPI_MSS0TX              ((uint32_t)0x30UL) /**< CTRL_REQUEST_SPI_MSS0TX Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_SPI_MSS0TX              (MXC_V_DMA_REVA_CTRL_REQUEST_SPI_MSS0TX << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_SPI_MSS0TX Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_USBTXEP1                ((uint32_t)0x31UL) /**< CTRL_REQUEST_USBTXEP1 Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_USBTXEP1                (MXC_V_DMA_REVA_CTRL_REQUEST_USBTXEP1 << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBTXEP1 Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_USBTXEP2                ((uint32_t)0x32UL) /**< CTRL_REQUEST_USBTXEP2 Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_USBTXEP2                (MXC_V_DMA_REVA_CTRL_REQUEST_USBTXEP2 << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBTXEP2 Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_USBTXEP3                ((uint32_t)0x33UL) /**< CTRL_REQUEST_USBTXEP3 Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_USBTXEP3                (MXC_V_DMA_REVA_CTRL_REQUEST_USBTXEP3 << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBTXEP3 Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_USBTXEP4                ((uint32_t)0x34UL) /**< CTRL_REQUEST_USBTXEP4 Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_USBTXEP4                (MXC_V_DMA_REVA_CTRL_REQUEST_USBTXEP4 << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBTXEP4 Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_USBTXEP5                ((uint32_t)0x35UL) /**< CTRL_REQUEST_USBTXEP5 Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_USBTXEP5                (MXC_V_DMA_REVA_CTRL_REQUEST_USBTXEP5 << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBTXEP5 Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_USBTXEP6                ((uint32_t)0x36UL) /**< CTRL_REQUEST_USBTXEP6 Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_USBTXEP6                (MXC_V_DMA_REVA_CTRL_REQUEST_USBTXEP6 << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBTXEP6 Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_USBTXEP7                ((uint32_t)0x37UL) /**< CTRL_REQUEST_USBTXEP7 Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_USBTXEP7                (MXC_V_DMA_REVA_CTRL_REQUEST_USBTXEP7 << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBTXEP7 Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_USBTXEP8                ((uint32_t)0x38UL) /**< CTRL_REQUEST_USBTXEP8 Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_USBTXEP8                (MXC_V_DMA_REVA_CTRL_REQUEST_USBTXEP8 << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBTXEP8 Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_USBTXEP9                ((uint32_t)0x39UL) /**< CTRL_REQUEST_USBTXEP9 Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_USBTXEP9                (MXC_V_DMA_REVA_CTRL_REQUEST_USBTXEP9 << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBTXEP9 Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_USBTXEP10               ((uint32_t)0x3AUL) /**< CTRL_REQUEST_USBTXEP10 Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_USBTXEP10               (MXC_V_DMA_REVA_CTRL_REQUEST_USBTXEP10 << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBTXEP10 Setting */
 #define MXC_V_DMA_REVA_CTRL_REQUEST_USBTXEP11               ((uint32_t)0x3BUL) /**< CTRL_REQUEST_USBTXEP11 Value */
 #define MXC_S_DMA_REVA_CTRL_REQUEST_USBTXEP11               (MXC_V_DMA_REVA_CTRL_REQUEST_USBTXEP11 << MXC_F_DMA_REVA_CTRL_REQUEST_POS) /**< CTRL_REQUEST_USBTXEP11 Setting */

