ARMmbed/mbed-os/targets/TARGET_Maxim/TARGET_MAX32670/Libraries/PeriphDrivers/Source/DMA/dma_reva_regs.h
 #define MXC_F_DMA_REVA_CTRL_TO_WAIT_POS                     10 /**< CTRL_TO_WAIT Position */
 #define MXC_F_DMA_REVA_CTRL_TO_WAIT                         ((uint32_t)(0x1UL << MXC_F_DMA_REVA_CTRL_TO_WAIT_POS)) /**< CTRL_TO_WAIT Mask */

 #define MXC_F_DMA_REVA_CTRL_TO_PER_POS                      11 /**< CTRL_TO_PER Position */
 #define MXC_F_DMA_REVA_CTRL_TO_PER                          ((uint32_t)(0x7UL << MXC_F_DMA_REVA_CTRL_TO_PER_POS)) /**< CTRL_TO_PER Mask */
 #define MXC_V_DMA_REVA_CTRL_TO_PER_TO4                      ((uint32_t)0x0UL) /**< CTRL_TO_PER_TO4 Value */
 #define MXC_S_DMA_REVA_CTRL_TO_PER_TO4                      (MXC_V_DMA_REVA_CTRL_TO_PER_TO4 << MXC_F_DMA_REVA_CTRL_TO_PER_POS) /**< CTRL_TO_PER_TO4 Setting */
 #define MXC_V_DMA_REVA_CTRL_TO_PER_TO8                      ((uint32_t)0x1UL) /**< CTRL_TO_PER_TO8 Value */
 #define MXC_S_DMA_REVA_CTRL_TO_PER_TO8                      (MXC_V_DMA_REVA_CTRL_TO_PER_TO8 << MXC_F_DMA_REVA_CTRL_TO_PER_POS) /**< CTRL_TO_PER_TO8 Setting */
 #define MXC_V_DMA_REVA_CTRL_TO_PER_TO16                     ((uint32_t)0x2UL) /**< CTRL_TO_PER_TO16 Value */
 #define MXC_S_DMA_REVA_CTRL_TO_PER_TO16                     (MXC_V_DMA_REVA_CTRL_TO_PER_TO16 << MXC_F_DMA_REVA_CTRL_TO_PER_POS) /**< CTRL_TO_PER_TO16 Setting */
 #define MXC_V_DMA_REVA_CTRL_TO_PER_TO32                     ((uint32_t)0x3UL) /**< CTRL_TO_PER_TO32 Value */
 #define MXC_S_DMA_REVA_CTRL_TO_PER_TO32                     (MXC_V_DMA_REVA_CTRL_TO_PER_TO32 << MXC_F_DMA_REVA_CTRL_TO_PER_POS) /**< CTRL_TO_PER_TO32 Setting */
 #define MXC_V_DMA_REVA_CTRL_TO_PER_TO64                     ((uint32_t)0x4UL) /**< CTRL_TO_PER_TO64 Value */
 #define MXC_S_DMA_REVA_CTRL_TO_PER_TO64                     (MXC_V_DMA_REVA_CTRL_TO_PER_TO64 << MXC_F_DMA_REVA_CTRL_TO_PER_POS) /**< CTRL_TO_PER_TO64 Setting */
 #define MXC_V_DMA_REVA_CTRL_TO_PER_TO128                    ((uint32_t)0x5UL) /**< CTRL_TO_PER_TO128 Value */
 #define MXC_S_DMA_REVA_CTRL_TO_PER_TO128                    (MXC_V_DMA_REVA_CTRL_TO_PER_TO128 << MXC_F_DMA_REVA_CTRL_TO_PER_POS) /**< CTRL_TO_PER_TO128 Setting */
 #define MXC_V_DMA_REVA_CTRL_TO_PER_TO256                    ((uint32_t)0x6UL) /**< CTRL_TO_PER_TO256 Value */
 #define MXC_S_DMA_REVA_CTRL_TO_PER_TO256                    (MXC_V_DMA_REVA_CTRL_TO_PER_TO256 << MXC_F_DMA_REVA_CTRL_TO_PER_POS) /**< CTRL_TO_PER_TO256 Setting */
 #define MXC_V_DMA_REVA_CTRL_TO_PER_TO512                    ((uint32_t)0x7UL) /**< CTRL_TO_PER_TO512 Value */
 #define MXC_S_DMA_REVA_CTRL_TO_PER_TO512                    (MXC_V_DMA_REVA_CTRL_TO_PER_TO512 << MXC_F_DMA_REVA_CTRL_TO_PER_POS) /**< CTRL_TO_PER_TO512 Setting */

 #define MXC_F_DMA_REVA_CTRL_TO_CLKDIV_POS                   14 /**< CTRL_TO_CLKDIV Position */
 #define MXC_F_DMA_REVA_CTRL_TO_CLKDIV                       ((uint32_t)(0x3UL << MXC_F_DMA_REVA_CTRL_TO_CLKDIV_POS)) /**< CTRL_TO_CLKDIV Mask */
 #define MXC_V_DMA_REVA_CTRL_TO_CLKDIV_DIS                   ((uint32_t)0x0UL) /**< CTRL_TO_CLKDIV_DIS Value */
 #define MXC_S_DMA_REVA_CTRL_TO_CLKDIV_DIS                   (MXC_V_DMA_REVA_CTRL_TO_CLKDIV_DIS << MXC_F_DMA_REVA_CTRL_TO_CLKDIV_POS) /**< CTRL_TO_CLKDIV_DIS Setting */
 #define MXC_V_DMA_REVA_CTRL_TO_CLKDIV_DIV256                ((uint32_t)0x1UL) /**< CTRL_TO_CLKDIV_DIV256 Value */
 #define MXC_S_DMA_REVA_CTRL_TO_CLKDIV_DIV256                (MXC_V_DMA_REVA_CTRL_TO_CLKDIV_DIV256 << MXC_F_DMA_REVA_CTRL_TO_CLKDIV_POS) /**< CTRL_TO_CLKDIV_DIV256 Setting */
 #define MXC_V_DMA_REVA_CTRL_TO_CLKDIV_DIV64K                ((uint32_t)0x2UL) /**< CTRL_TO_CLKDIV_DIV64K Value */
 #define MXC_S_DMA_REVA_CTRL_TO_CLKDIV_DIV64K                (MXC_V_DMA_REVA_CTRL_TO_CLKDIV_DIV64K << MXC_F_DMA_REVA_CTRL_TO_CLKDIV_POS) /**< CTRL_TO_CLKDIV_DIV64K Setting */
 #define MXC_V_DMA_REVA_CTRL_TO_CLKDIV_DIV16M                ((uint32_t)0x3UL) /**< CTRL_TO_CLKDIV_DIV16M Value */
 #define MXC_S_DMA_REVA_CTRL_TO_CLKDIV_DIV16M                (MXC_V_DMA_REVA_CTRL_TO_CLKDIV_DIV16M << MXC_F_DMA_REVA_CTRL_TO_CLKDIV_POS) /**< CTRL_TO_CLKDIV_DIV16M Setting */

 #define MXC_F_DMA_REVA_CTRL_SRCWD_POS                       16 /**< CTRL_SRCWD Position */
 #define MXC_F_DMA_REVA_CTRL_SRCWD                           ((uint32_t)(0x3UL << MXC_F_DMA_REVA_CTRL_SRCWD_POS)) /**< CTRL_SRCWD Mask */
 #define MXC_V_DMA_REVA_CTRL_SRCWD_BYTE                      ((uint32_t)0x0UL) /**< CTRL_SRCWD_BYTE Value */
 #define MXC_S_DMA_REVA_CTRL_SRCWD_BYTE                      (MXC_V_DMA_REVA_CTRL_SRCWD_BYTE << MXC_F_DMA_REVA_CTRL_SRCWD_POS) /**< CTRL_SRCWD_BYTE Setting */
 #define MXC_V_DMA_REVA_CTRL_SRCWD_HALFWORD                  ((uint32_t)0x1UL) /**< CTRL_SRCWD_HALFWORD Value */
 #define MXC_S_DMA_REVA_CTRL_SRCWD_HALFWORD                  (MXC_V_DMA_REVA_CTRL_SRCWD_HALFWORD << MXC_F_DMA_REVA_CTRL_SRCWD_POS) /**< CTRL_SRCWD_HALFWORD Setting */
 #define MXC_V_DMA_REVA_CTRL_SRCWD_WORD                      ((uint32_t)0x2UL) /**< CTRL_SRCWD_WORD Value */
 #define MXC_S_DMA_REVA_CTRL_SRCWD_WORD                      (MXC_V_DMA_REVA_CTRL_SRCWD_WORD << MXC_F_DMA_REVA_CTRL_SRCWD_POS) /**< CTRL_SRCWD_WORD Setting */

 #define MXC_F_DMA_REVA_CTRL_SRCINC_POS                      18 /**< CTRL_SRCINC Position */
 #define MXC_F_DMA_REVA_CTRL_SRCINC                          ((uint32_t)(0x1UL << MXC_F_DMA_REVA_CTRL_SRCINC_POS)) /**< CTRL_SRCINC Mask */

 #define MXC_F_DMA_REVA_CTRL_DSTWD_POS                       20 /**< CTRL_DSTWD Position */
 #define MXC_F_DMA_REVA_CTRL_DSTWD                           ((uint32_t)(0x3UL << MXC_F_DMA_REVA_CTRL_DSTWD_POS)) /**< CTRL_DSTWD Mask */
 #define MXC_V_DMA_REVA_CTRL_DSTWD_BYTE                      ((uint32_t)0x0UL) /**< CTRL_DSTWD_BYTE Value */
 #define MXC_S_DMA_REVA_CTRL_DSTWD_BYTE                      (MXC_V_DMA_REVA_CTRL_DSTWD_BYTE << MXC_F_DMA_REVA_CTRL_DSTWD_POS) /**< CTRL_DSTWD_BYTE Setting */
 #define MXC_V_DMA_REVA_CTRL_DSTWD_HALFWORD                  ((uint32_t)0x1UL) /**< CTRL_DSTWD_HALFWORD Value */
 #define MXC_S_DMA_REVA_CTRL_DSTWD_HALFWORD                  (MXC_V_DMA_REVA_CTRL_DSTWD_HALFWORD << MXC_F_DMA_REVA_CTRL_DSTWD_POS) /**< CTRL_DSTWD_HALFWORD Setting */
 #define MXC_V_DMA_REVA_CTRL_DSTWD_WORD                      ((uint32_t)0x2UL) /**< CTRL_DSTWD_WORD Value */
 #define MXC_S_DMA_REVA_CTRL_DSTWD_WORD                      (MXC_V_DMA_REVA_CTRL_DSTWD_WORD << MXC_F_DMA_REVA_CTRL_DSTWD_POS) /**< CTRL_DSTWD_WORD Setting */

 #define MXC_F_DMA_REVA_CTRL_DSTINC_POS                      22 /**< CTRL_DSTINC Position */
 #define MXC_F_DMA_REVA_CTRL_DSTINC                          ((uint32_t)(0x1UL << MXC_F_DMA_REVA_CTRL_DSTINC_POS)) /**< CTRL_DSTINC Mask */

 #define MXC_F_DMA_REVA_CTRL_BURST_SIZE_POS                  24 /**< CTRL_BURST_SIZE Position */
 #define MXC_F_DMA_REVA_CTRL_BURST_SIZE                      ((uint32_t)(0x1FUL << MXC_F_DMA_REVA_CTRL_BURST_SIZE_POS)) /**< CTRL_BURST_SIZE Mask */

