ARMmbed/mbed-os/targets/TARGET_Maxim/TARGET_MAX32670/Libraries/PeriphDrivers/Source/DMA/dma_reva_regs.h
 #define MXC_F_DMA_REVA_CTRL_DIS_IE_POS                      30 /**< CTRL_DIS_IE Position */
 #define MXC_F_DMA_REVA_CTRL_DIS_IE                          ((uint32_t)(0x1UL << MXC_F_DMA_REVA_CTRL_DIS_IE_POS)) /**< CTRL_DIS_IE Mask */

 #define MXC_F_DMA_REVA_CTRL_CTZ_IE_POS                      31 /**< CTRL_CTZ_IE Position */
 #define MXC_F_DMA_REVA_CTRL_CTZ_IE                          ((uint32_t)(0x1UL << MXC_F_DMA_REVA_CTRL_CTZ_IE_POS)) /**< CTRL_CTZ_IE Mask */

/**@} end of group DMA_CTRL_Register */

/**
 * @ingroup  dma_registers
 * @defgroup DMA_STATUS DMA_STATUS
 * @brief    DMA Channel Status Register.
 * @{
 */
 #define MXC_F_DMA_REVA_STATUS_STATUS_POS                    0 /**< STATUS_STATUS Position */
 #define MXC_F_DMA_REVA_STATUS_STATUS                        ((uint32_t)(0x1UL << MXC_F_DMA_REVA_STATUS_STATUS_POS)) /**< STATUS_STATUS Mask */

 #define MXC_F_DMA_REVA_STATUS_IPEND_POS                     1 /**< STATUS_IPEND Position */
 #define MXC_F_DMA_REVA_STATUS_IPEND                         ((uint32_t)(0x1UL << MXC_F_DMA_REVA_STATUS_IPEND_POS)) /**< STATUS_IPEND Mask */

 #define MXC_F_DMA_REVA_STATUS_CTZ_IF_POS                    2 /**< STATUS_CTZ_IF Position */
 #define MXC_F_DMA_REVA_STATUS_CTZ_IF                        ((uint32_t)(0x1UL << MXC_F_DMA_REVA_STATUS_CTZ_IF_POS)) /**< STATUS_CTZ_IF Mask */

 #define MXC_F_DMA_REVA_STATUS_RLD_IF_POS                    3 /**< STATUS_RLD_IF Position */
 #define MXC_F_DMA_REVA_STATUS_RLD_IF                        ((uint32_t)(0x1UL << MXC_F_DMA_REVA_STATUS_RLD_IF_POS)) /**< STATUS_RLD_IF Mask */

 #define MXC_F_DMA_REVA_STATUS_BUS_ERR_POS                   4 /**< STATUS_BUS_ERR Position */
 #define MXC_F_DMA_REVA_STATUS_BUS_ERR                       ((uint32_t)(0x1UL << MXC_F_DMA_REVA_STATUS_BUS_ERR_POS)) /**< STATUS_BUS_ERR Mask */

 #define MXC_F_DMA_REVA_STATUS_TO_IF_POS                     6 /**< STATUS_TO_IF Position */
 #define MXC_F_DMA_REVA_STATUS_TO_IF                         ((uint32_t)(0x1UL << MXC_F_DMA_REVA_STATUS_TO_IF_POS)) /**< STATUS_TO_IF Mask */

/**@} end of group DMA_STATUS_Register */

/**
 * @ingroup  dma_registers
 * @defgroup DMA_SRC DMA_SRC
 * @brief    Source Device Address. If SRCINC=1, the counter bits are incremented by 1,2, or
 *           4, depending on the data width of each AHB cycle. For peripheral transfers, some
 *           or all of the actual address bits are fixed. If SRCINC=0, this register remains
 *           constant. In the case where a count-to-zero condition occurs while RLDEN=1, the
 *           register is reloaded with the contents of DMA_SRC_RLD.
 * @{
 */
 #define MXC_F_DMA_REVA_SRC_ADDR_POS                         0 /**< SRC_ADDR Position */
 #define MXC_F_DMA_REVA_SRC_ADDR                             ((uint32_t)(0xFFFFFFFFUL << MXC_F_DMA_REVA_SRC_ADDR_POS)) /**< SRC_ADDR Mask */

/**@} end of group DMA_SRC_Register */

/**
 * @ingroup  dma_registers
 * @defgroup DMA_DST DMA_DST
 * @brief    Destination Device Address. For peripheral transfers, some or all of the actual
 *           address bits are fixed. If DSTINC=1, this register is incremented on every AHB
 *           write out of the DMA FIFO. They are incremented by 1, 2, or 4, depending on the
 *           data width of each AHB cycle. In the case where a count-to-zero condition occurs
 *           while RLDEN=1, the register is reloaded with DMA_DST_RLD.
 * @{
 */
 #define MXC_F_DMA_REVA_DST_ADDR_POS                         0 /**< DST_ADDR Position */
 #define MXC_F_DMA_REVA_DST_ADDR                             ((uint32_t)(0xFFFFFFFFUL << MXC_F_DMA_REVA_DST_ADDR_POS)) /**< DST_ADDR Mask */

/**@} end of group DMA_DST_Register */

/**
 * @ingroup  dma_registers
 * @defgroup DMA_CNT DMA_CNT
 * @brief    DMA Counter. The user loads this register with the number of bytes to transfer.
 *           This counter decreases on every AHB cycle into the DMA FIFO. The decrement will
 *           be 1, 2, or 4 depending on the data width of each AHB cycle. When the counter
 *           reaches 0, a count-to-zero condition is triggered.
 * @{
 */
 #define MXC_F_DMA_REVA_CNT_CNT_POS                          0 /**< CNT_CNT Position */
 #define MXC_F_DMA_REVA_CNT_CNT                              ((uint32_t)(0xFFFFFFUL << MXC_F_DMA_REVA_CNT_CNT_POS)) /**< CNT_CNT Mask */

/**@} end of group DMA_CNT_Register */

/**
 * @ingroup  dma_registers
 * @defgroup DMA_SRCRLD DMA_SRCRLD
 * @brief    Source Address Reload Value. The value of this register is loaded into DMA0_SRC
 *           upon a count-to-zero condition.
 * @{
 */
 #define MXC_F_DMA_REVA_SRCRLD_ADDR_POS                      0 /**< SRCRLD_ADDR Position */
 #define MXC_F_DMA_REVA_SRCRLD_ADDR                          ((uint32_t)(0x7FFFFFFFUL << MXC_F_DMA_REVA_SRCRLD_ADDR_POS)) /**< SRCRLD_ADDR Mask */

/**@} end of group DMA_SRCRLD_Register */

/**
 * @ingroup  dma_registers
 * @defgroup DMA_DSTRLD DMA_DSTRLD
 * @brief    Destination Address Reload Value. The value of this register is loaded into
 *           DMA0_DST upon a count-to-zero condition.
 * @{
 */
 #define MXC_F_DMA_REVA_DSTRLD_ADDR_POS                      0 /**< DSTRLD_ADDR Position */
 #define MXC_F_DMA_REVA_DSTRLD_ADDR                          ((uint32_t)(0x7FFFFFFFUL << MXC_F_DMA_REVA_DSTRLD_ADDR_POS)) /**< DSTRLD_ADDR Mask */

/**@} end of group DMA_DSTRLD_Register */

/**
 * @ingroup  dma_registers
 * @defgroup DMA_CNTRLD DMA_CNTRLD
 * @brief    DMA Channel Count Reload Register.
 * @{
 */
 #define MXC_F_DMA_REVA_CNTRLD_CNT_POS                       0 /**< CNTRLD_CNT Position */
 #define MXC_F_DMA_REVA_CNTRLD_CNT                           ((uint32_t)(0xFFFFFFUL << MXC_F_DMA_REVA_CNTRLD_CNT_POS)) /**< CNTRLD_CNT Mask */

 #define MXC_F_DMA_REVA_CNTRLD_EN_POS                        31 /**< CNTRLD_EN Position */
 #define MXC_F_DMA_REVA_CNTRLD_EN                            ((uint32_t)(0x1UL << MXC_F_DMA_REVA_CNTRLD_EN_POS)) /**< CNTRLD_EN Mask */

/**@} end of group DMA_CNTRLD_Register */

#ifdef __cplusplus
}
#endif

#endif /* _DMA_REVA_REGS_H_ */
